{
  "tier_1_determinative": {
    "attempt_to_extract_cash": "Yes, the accused attempted to extract cash and valuables from the victim Vijay Sadavate by threatening to kill him.",
    "threat_to_kill": "Yes, threats to kill were extended to Vijay Sadavate during the robbery attempt.",
    "weapon_used": "Knife was used by one of the accused to inflict injury on Vijay Sadavate.",
    "injury_detail": "Vijay Sadavate received a bleeding injury on the back of his head, and Pradeep Pawar sustained a bleeding injury to his right palm.",
    "actus_reus_description": "The accused attempted to rob Vijay Sadavate and Pradeep Pawar by threatening them with a knife and causing injuries."
  },
  "tier_2_material": {
    "number_of_perpetrators": "Three accused persons were involved in the offense.",
    "victim_identity": "Vijay Sadavate and Pradeep Pawar were the victims.",
    "previous_similar_incident": "Yes, a similar attempt to rob Pradeep Pawar occurred shortly before the incident with Vijay Sadavate.",
    "medical_evidence": "Medical evidence confirmed injuries to Vijay Sadavate's head and Pradeep Pawar's right palm.",
    "identification_parade": "A Test Identification Parade was conducted where the accused were identified by the victims."
  },
  "tier_3_contextual": {
    "incident_date_time": "The incident occurred on 24th October 2009 at about 11.30 p.m.",
    "incident_location": "The incident took place near Chembur Railway Station, Mumbai.",
    "victim_activity_before_incident": "Vijay Sadavate was returning home from work and had alighted from a local train at Chembur Railway Station."
  },
  "tier_4_procedural": {
    "case_number": "Criminal Appeal No.290 of 2014",
    "case_title": "Aakash Ramchandra Chavan vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "29th August 2019",
    "appellant_or_petitioner": "Aakash Ramchandra Chavan",
    "respondent": "The State of Maharashtra",
    "judges_coram": "A. M. BADAR, J.",
    "counsel_for_appellant": "Mrs. N.S.K. Ayubi",
    "counsel_for_respondent": "Mr. Amit Palkar, APP",
    "sections_invoked": "Section 394 read with Section 397 of the Indian Penal Code",
    "case_type": "Criminal Appeal",
    "citation": ".",
    "acts_and_sections": "Indian Penal Code, Sections 394 and 397"
  },
  "residual_details": {
    "additional_facts": "The accused Aakash Chavan was identified by the victims during the trial, and discrepancies in the victim's testimonies were deemed minor and not affecting the case outcome."
  },
  "template_id": "ipc_397",
  "template_label": "Robbery or dacoity, with attempt to cause death or grievous hurt (IPC 397)",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T15:30:54.956047"
}