{
  "tier_1_determinative": {
    "mischief_act": "Withdrawal of TADA charges to facilitate the release of Veerappan's associates from judicial custody.",
    "damage_amount": "Not applicable as this is not a financial damage case but a legal and procedural issue."
  },
  "tier_2_material": {
    "property_description": "The legal charges under TADA against Veerappan's associates were affected."
  },
  "tier_3_contextual": {
    "incident_location": "The incident relates to the border region between Karnataka and Tamil Nadu, specifically involving the Designated Court at Mysore and Chennai.",
    "incident_date_time": "The events unfolded around the abduction on 30th July 2000, and subsequent court orders on 19th August 2000 and 28th August 2000."
  },
  "tier_4_procedural": {
    "case_number": "Not explicitly mentioned in the provided text.",
    "case_title": "Abdul Karim v. State of Karnataka and Ors.",
    "court_name": "Supreme Court of India",
    "judgment_date": "November 7, 2000",
    "appellant_or_petitioner": "Abdul Karim",
    "respondent": "State of Karnataka and Others",
    "judges_coram": "S.P. Bharucha, D.P. Mohapatra, and Y.K. Sabharwal, JJ.",
    "counsel_for_appellant": "Not explicitly mentioned in the provided text.",
    "counsel_for_respondent": "Not explicitly mentioned in the provided text.",
    "sections_invoked": "Section 321 of the Code of Criminal Procedure, Terrorist and Disruptive Activities Act (TADA), National Security Act (NSA)",
    "case_type": "Criminal Appeal",
    "citation": "[2000] SUPP. 4 S.C.R. 382",
    "acts_and_sections": "Code of Criminal Procedure, 1973; Terrorist and Disruptive Activities Act; National Security Act"
  },
  "residual_details": {
    "additional_facts": "Veerappan, a notorious criminal, kidnapped popular film actor Rajkumar. The State Government conceded to Veerappan's demands to withdraw TADA charges against his associates to ensure Rajkumar's release. The Supreme Court criticized the actions of the State Government and the Public Prosecutor for not independently assessing the public interest."
  },
  "template_id": "ipc_427",
  "template_label": "Mischief causing damage (IPC 427)",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T18:00:30.384031"
}