{
  "tier_1_determinative": {
    "key_facts": "The Appellant was convicted for sexually assaulting a 4-year-old victim at his house on 09/02/2018. The victim narrated the incident to her parents, leading to the filing of an FIR and subsequent arrest of the Appellant."
  },
  "tier_2_material": {
    "material_facts": "The Appellant's daughter was a friend of the victim. On the day of the incident, the Appellant sent his daughter outside and committed the offence when the victim was alone. Medical examinations and statements were conducted, and witnesses were examined during the trial."
  },
  "tier_3_contextual": {
    "incident_location": "Appellant's house",
    "incident_date_time": "09/02/2018"
  },
  "tier_4_procedural": {
    "case_number": "CRIMINAL APPEAL NO. 23 OF 2020",
    "case_title": "Raju @ Abdul Haq Shaikh Mohammed Hanif vs. The State of Maharashtra & Anr.",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "8th December 2022",
    "appellant_or_petitioner": "Raju @ Abdul Haq Shaikh Mohammed Hanif",
    "respondent": "The State of Maharashtra & Anr.",
    "judges_coram": "SARANG V. KOTWAL, J.",
    "counsel_for_appellant": "Mr. Aditya Bapat (Appointed Advocate)",
    "counsel_for_respondent": "Smt. M. R. Tidke, APP for State/Respondent No.1, Ms. Jai V. Kanade (Appointed Advocate) a/w. Rahul Shirgavkar for Respondent No.2",
    "sections_invoked": "Sections 6, 8, 12 of POCSO Act; Section 376 of IPC",
    "case_type": "Criminal Appeal",
    "citation": null,
    "acts_and_sections": "Protection of Children from Sexual Offences Act (POCSO Act), Indian Penal Code (IPC)"
  },
  "residual_details": {
    "additional_facts": "The Appellant was convicted under multiple sections of the POCSO Act and IPC, sentenced to various terms of rigorous imprisonment, and fined. The substantive sentences were directed to run concurrently, and a portion of the fine was ordered as compensation to the victim. The Appellant's defence was of total denial, claiming a false implication due to a dispute with the victim's father."
  }
}