{
  "tier_1_determinative": {
    "key_facts": "The Applicant, Aman Kumar Singh, is seeking anticipatory bail in connection with C.R.No.148/2023 registered under multiple sections of IPC, Maharashtra Prohibition of Gambling Act, and Indian Telegraph Act. The FIR was lodged after a raid found four persons taking bets using forged documents for SIM cards. The Applicant was not named in the FIR and there is no material evidence against him showing direct or indirect involvement."
  },
  "tier_2_material": {
    "material_facts": "The FIR was lodged by Police Constable Nitin Lokhande after a raid on 26.5.2023 at a flat in front of the MCA Cricket Stadium on Mumbai-Pune Expressway. The raiding party found evidence of gambling and forged SIM cards."
  },
  "tier_3_contextual": {
    "incident_location": "A flat in front of the MCA Cricket Stadium on Mumbai-Pune Expressway",
    "incident_date_time": "26th May 2023"
  },
  "tier_4_procedural": {
    "case_number": "Anticipatory Bail Application No.3370 of 2023",
    "case_title": "Aman Kumar Singh vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "31st January, 2024",
    "appellant_or_petitioner": "Aman Kumar Singh",
    "respondent": "The State of Maharashtra",
    "judges_coram": "Sarang V. Kotwal, J.",
    "counsel_for_appellant": "Mr. Farooq Sothi, Advocate a/w. Rupali Sawant i/b. S.P. Associates",
    "counsel_for_respondent": "Smt. M.H. Mhatre, APP",
    "sections_invoked": "Sections 420, 465, 468, 471 read with 34 of IPC, Section 4(a) of the Maharashtra Prohibition of Gambling Act, Section 25(c) of the Indian Telegraph Act",
    "case_type": "Anticipatory Bail Application",
    "citation": null,
    "acts_and_sections": "IPC, Maharashtra Prohibition of Gambling Act, Indian Telegraph Act"
  },
  "residual_details": {
    "additional_facts": "The Applicant's anticipatory bail was initially rejected by the Sessions Court due to incorrect submissions about his involvement. The investigating officer confirmed there is no evidence against the Applicant."
  }
}