{
  "tier_1_determinative": {
    "key_facts": "The key determinative facts are that the applicant, Arshad Ali Chhotehussain Shaikh, was apprehended after a robbery and sexual assault incident occurred on the Pushpak Express train between Igatpuri and Kasara on October 8, 2021. The applicant was not specifically identified as a participant in the robbery or sexual assault but was detained based on suspicion after being found in a train compartment where the robbery took place. No stolen property was recovered from him, and he was not seen with the gang of robbers when they boarded the train or when they jumped off. The court found that there was no prima facie evidence linking him directly to the crimes committed."
  },
  "tier_2_material": {
    "material_facts": "The material facts affecting the case include the fact that the applicant was wearing a saffron T-shirt and was found in the train's toilet after the robbery. He gave evasive answers when questioned by passengers, leading to suspicion. Witness statements and CCTV footage did not place him with the accused gang at Igatpuri station or fleeing at Kasara station. The applicant has been in custody since October 9, 2021, and the trial is expected to take a considerable time."
  },
  "tier_3_contextual": {
    "incident_location": "Pushpak Express train between Igatpuri and Kasara Railway Stations.",
    "incident_date_time": "8 October 2021 between 7.00 to 7.30 p.m."
  },
  "tier_4_procedural": {
    "case_number": "BAIL APPLICATION NO.1670 OF 2023",
    "case_title": "Arshad Ali Chhotehussain Shaikh vs. State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "13 March 2024",
    "appellant_or_petitioner": "Arshad Ali Chhotehussain Shaikh",
    "respondent": "State of Maharashtra",
    "judges_coram": "N.J. JAMADAR, J.",
    "counsel_for_appellant": "Mr. Kalam Shaikh with Ms. Sana Shaikh",
    "counsel_for_respondent": "Mr. Shailesh S. Ghag, APP for State",
    "sections_invoked": "Sections 395, 397, 376D, 354, 354B IPC; Sections 147 and 153 Indian Railways Act, 1989",
    "case_type": "Bail Application",
    "citation": "2024:BHC-AS:12652",
    "acts_and_sections": "Indian Penal Code, Indian Railways Act, 1989"
  },
  "residual_details": {
    "additional_facts": "The court noted the seriousness of the accusations but found that the applicant's continued detention was not warranted given the lack of direct evidence. The court ordered bail with conditions to ensure the applicant's presence and prevent interference with the investigation."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:16:22.532845"
}