{
  "tier_1_determinative": {
    "key_facts": "The accused, Bhai Bhikaji Rane, was charged with the murder of Archana, a widow who was last seen with him. He allegedly posed as a PWD officer to deceive her into believing he could legalize her vada-pav stall. Archana was last seen on 30-1-2000, and her body was discovered later. The prosecution used circumstantial evidence to link the accused to the crime, including the sale of Archana's gold ornaments by the accused."
  },
  "tier_2_material": {
    "material_facts": "Archana was a widow managing a vada-pav stall and was acquainted with the accused, who misrepresented himself as a PWD officer. On 30-1-2000, Archana left with the accused to legalize her stall but never returned. Her body was later identified, and the accused was arrested. The prosecution's case relied on circumstantial evidence, including witnesses who saw the accused with Archana and the recovery of her gold ornaments."
  },
  "tier_3_contextual": {
    "incident_location": "Sindhudurg, Maharashtra",
    "incident_date_time": "30th January 2000"
  },
  "tier_4_procedural": {
    "case_number": "Criminal Appeal No. 116 of 2002",
    "case_title": "Bhai Bhikaji Rane vs. State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "10th October 2006",
    "appellant_or_petitioner": "Bhai Bhikaji Rane",
    "respondent": "State of Maharashtra",
    "judges_coram": "V.G. Palshikar & Smt. Nishita Mhatre, JJ.",
    "counsel_for_appellant": "Shri A.S. Khandeparkar",
    "counsel_for_respondent": "Smt. V.R. Bhosale, APP",
    "sections_invoked": "Sections 419, 392, 302 of IPC",
    "case_type": "Criminal Appeal",
    "citation": "",
    "acts_and_sections": "Indian Penal Code, Sections 419, 392, 302"
  },
  "residual_details": {
    "additional_facts": "The trial court convicted the accused based on circumstantial evidence. The High Court reappraised the evidence, noting the lack of direct evidence linking the accused to the murder and questioning the adequacy of the circumstantial evidence to establish guilt beyond reasonable doubt."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:37:31.082615"
}