{
  "tier_1_determinative": {
    "five_or_more_persons_committing_dacoity": "The incident involved multiple accused, including Ayyub alias Guddu Khan, Nilesh Jagtap, and others, who boarded the container and forced the driver to change the route. This indicates a group of five or more persons involved in the dacoity."
  },
  "tier_2_material": {
    "property_stolen": "2200 boxes of beer were stolen from a container bearing No. MH-43-BG-5463."
  },
  "tier_3_contextual": {
    "incident_location": "The container left the Kingfisher factory at Walunj, Dist. Aurangabad, and the incidents took place at Gangapur, Dist. Aurangabad, and later at Nashik.",
    "incident_date_time": "The exact date and time are not specified, but the report was lodged in connection with C.R. No. 144 of 2022."
  },
  "tier_4_procedural": {
    "case_number": "Anticipatory Bail Application Nos. 3559 of 2022, 3560 of 2022, and 4 of 2023",
    "case_title": "Bharat Tatya Khotare vs. The State of Maharashtra; Devnath Mahadu Bendkoli vs. The State of Maharashtra; Mahendra Tulshiram @ Tulshidas Pawar vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "5th September, 2023",
    "appellant_or_petitioner": "Bharat Tatya Khotare, Devnath Mahadu Bendkoli, Mahendra Tulshiram @ Tulshidas Pawar",
    "respondent": "The State of Maharashtra",
    "judges_coram": "N. J. JAMADAR, J.",
    "counsel_for_appellant": "Mr. Ganesh K. Gole with Mr. Viraj Shelatkar i/b Ateet Shirodkar",
    "counsel_for_respondent": "Mr. R. M. Pethe, APP for State",
    "sections_invoked": "Sections 395, 412, 343, 504, and 506 of Indian Penal Code, 1860",
    "case_type": "Criminal Appellate Jurisdiction - Anticipatory Bail Application",
    "citation": ".DOC 24-ABA-3359-22+",
    "acts_and_sections": "Indian Penal Code, 1860, Sections 395, 412, 343, 504, and 506"
  },
  "residual_details": {
    "additional_facts": "A few accused were arrested, and 1062 boxes of beer were recovered. Bharat Khotare allegedly had 750 boxes unloaded at his field, Devnath Bendkoli was involved in the dacoity and purchasing stolen property, and Mahendra Pawar allegedly sold 100 boxes of beer. Devnath Bendkoli had previous offenses under Section 395 registered against him."
  },
  "template_id": "ipc_395",
  "template_label": "Punishment for dacoity (IPC 395)",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:37:50.121948"
}