{
  "tier_1_determinative": {
    "key_facts": "The appellants, Chetan Ramdas Dumbre and Nilesh Dnyaneshwar Vitekar, were acquitted of the offenses punishable under sections 302 and 394 read with 34 of the IPC. The conviction was primarily based on the alleged recovery of stolen ornaments, which was deemed unreliable due to inconsistencies and lack of credible evidence."
  },
  "tier_2_material": {
    "material_facts": "The appellants were initially convicted by the Additional Sessions Judge, Pune, based on the prosecution's claim that they entered the house of the deceased Bajirao Shankar Deokar and his wife Sunanda Deokar with the intent to commit robbery, which resulted in their murders. The prosecution relied on witnesses who claimed to have seen the accused near the crime scene and on the recovery of stolen jewelry allegedly sold by the accused."
  },
  "tier_3_contextual": {
    "incident_location": "Vadgaon Anand, Dist. Pune",
    "incident_date_time": "Intervening night of 20.06.2009 and 21.06.2009"
  },
  "tier_4_procedural": {
    "case_number": "Criminal Appeal No. 352 of 2012",
    "case_title": "Chetan Ramdas Dumbre & Anr. vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "17.03.2022",
    "appellant_or_petitioner": "Chetan Ramdas Dumbre and Nilesh Dnyaneshwar Vitekar",
    "respondent": "The State of Maharashtra",
    "judges_coram": "S.S. Shinde & N.R. Borkar, JJ.",
    "counsel_for_appellant": "Mr. Aashish Satpute",
    "counsel_for_respondent": "Mr. V.B. Kondedeshmukh",
    "sections_invoked": "Sections 302 and 394 read with 34 of the IPC",
    "case_type": "Criminal Appeal",
    "citation": "/j-cri-apeal-352-12.odt",
    "acts_and_sections": "Indian Penal Code, 1860, Sections 302 and 394 read with 34"
  },
  "residual_details": {
    "additional_facts": "The trial court acquitted the third accused of all offenses. The prosecution's case was weakened by the lack of a proper identification parade for the accused and inconsistencies in witness testimonies. The High Court found that the trial court had erred in its judgment due to the unreliable nature of the evidence presented."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:45:56.776997"
}