{
  "tier_1_determinative": {
    "attempt_to_extract_cash": "The appellant attempted to snatch a gold chain from Narayan Jadhav.",
    "threat_to_kill": "The appellant slit the throats of both Narayan Jadhav and Lata Jadhav with a knife during the robbery.",
    "weapon_used": "A knife was used by the appellant to inflict injuries on the victims.",
    "injury_detail": "Narayan Jadhav suffered a contusion lacerated wound over the neck of size 14 x 5 x 3 cm and another of size 15 x 5 x 3 cm, exposing the laryngeal cartilage and thyroid gland. Lata Jadhav had contusion lacerated wounds on her neck of size 16 x 4 x 3 cm and 14 x 3 x 3 cm.",
    "actus_reus_description": "The appellant entered the Jadhavs' house at night, demanded water, and then attacked them with a knife, causing grievous injuries and robbing them."
  },
  "tier_2_material": {
    "number_of_perpetrators": "One, the appellant Dablu Arun Vishwas.",
    "victim_identity": "Narayan Jadhav and his wife Lata Jadhav.",
    "previous_similar_incident": "There is no mention of previous similar incidents involving the accused in the provided text.",
    "medical_evidence": "Medical evidence included testimonies from Dr. Dipanjali Deshpande and Dr. Nitin Kurde, who treated the victims' serious knife wounds at Sanjivini Hospital.",
    "identification_parade": "There is no specific mention of an identification parade in the provided text."
  },
  "tier_3_contextual": {
    "incident_date_time": "The incident occurred on the night of 10th October 2014, around 10:45 p.m.",
    "incident_location": "The incident took place at the residence of the Jadhavs in Virar.",
    "victim_activity_before_incident": "The victims were at home. Before the incident, Lata Jadhav and her husband were interacting with the appellant regarding food orders."
  },
  "tier_4_procedural": {
    "case_number": "Criminal Appeal No.799 of 2016",
    "case_title": "Dablu Arun Vishwas vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "26th September 2019",
    "appellant_or_petitioner": "Dablu Arun Vishwas",
    "respondent": "The State of Maharashtra",
    "judges_coram": "A.M. Badar J.",
    "counsel_for_appellant": "Ms. Megha Bajoria",
    "counsel_for_respondent": "Mr. Vinod Chate",
    "sections_invoked": "Sections 394, 397, and 452 of the Indian Penal Code",
    "case_type": "Criminal Appeal",
    "citation": ".odt",
    "acts_and_sections": "Indian Penal Code Sections 394, 397, and 452"
  },
  "residual_details": {
    "additional_facts": "The appellant was known to the victims as he worked at a nearby food stall. The appellant was convicted and sentenced to ten years of rigorous imprisonment for robbery and additional sentences for related charges."
  },
  "template_id": "ipc_397",
  "template_label": "Robbery or dacoity, with attempt to cause death or grievous hurt (IPC 397)",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:48:12.492135"
}