{
  "tier_1_determinative": {
    "key_facts": "The State Government of Karnataka yielded to Veerappan's demands to withdraw TADA charges against his associates to facilitate their release, following the kidnapping of a popular film actor. The Public Prosecutor's application for withdrawal of charges lacked material evidence of independent application of mind in public interest, leading to the court granting consent for withdrawal of TADA charges, which was later deemed invalid as it did not meet the requirements of Section 321."
  },
  "tier_2_material": {
    "material_facts": "Veerappan, a notorious criminal, kidnapped film actor Rajkumar and demanded the withdrawal of TADA charges against his associates and their release. The State Government agreed to these demands, and the Public Prosecutor filed an application under Section 321 of the Code of Criminal Procedure to withdraw the charges, despite ongoing trials and recorded witness evidence."
  },
  "tier_3_contextual": {
    "incident_location": "Farmhouse (abduction of Rajkumar) and Mysore (court proceedings)",
    "incident_date_time": "July 30, 2000 (abduction of Rajkumar)"
  },
  "tier_4_procedural": {
    "case_number": null,
    "case_title": "ABDUL KARIM v. STATE OF KARNATAKA AND ORS.",
    "court_name": "Supreme Court of India",
    "judgment_date": "November 7, 2000",
    "appellant_or_petitioner": "Abdul Karim",
    "respondent": "State of Karnataka and others",
    "judges_coram": "S.P. Bharucha, D.P. Mohapatra, Y.K. Sabharwal",
    "counsel_for_appellant": null,
    "counsel_for_respondent": null,
    "sections_invoked": "Section 321 of the Code of Criminal Procedure, 1973",
    "case_type": "Criminal Appeal",
    "citation": "[2000] SUPP. 4 S.C.R. 382",
    "acts_and_sections": "Terrorist and Disruptive Activities Act (TADA), Indian Penal Code (IPC), Arms Act, Explosive Substances Act, National Security Act (NSA)"
  },
  "residual_details": {
    "additional_facts": "The application for withdrawal was made during an ongoing trial with evidence from 51 witnesses. The Special Public Prosecutor argued that other charges under the Arms Act and Explosive Substances Act covered provisions of TADA, and that the Central Government had already withdrawn the central enactment of TADA."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 0.0,
  "extraction_timestamp": "2025-11-25T07:21:32Z"
}