{
  "tier_1_determinative": {
    "key_facts": "Ashok Laxman Bhagyawant was convicted for the murder of his wife Ashwini Ashok Bhagyawant. He confessed to assaulting her, which was supported by the testimony of police and medical witnesses. The prosecution's case was based on circumstantial evidence, including the appellant's extra-judicial confessions to multiple witnesses and the presence of blood evidence."
  },
  "tier_2_material": {
    "material_facts": "The prosecution presented evidence of 17 injuries on the deceased's body, indicating a violent assault. The appellant was arrested after being seen carrying his injured wife to the hospital and then injuring himself by banging his head against a glass frame. His defense claimed a robbery occurred, but this was not substantiated. The trial court found the evidence against him to be reliable, dismissing his defense as unsubstantiated."
  },
  "tier_3_contextual": {
    "incident_location": "The incident occurred at the appellant's residence in Pune, and the deceased was taken to YCM Hospital, Pune.",
    "incident_date_time": "The incident was reported on 23rd January 2011, and the appellant was arrested on 24th January 2011."
  },
  "tier_4_procedural": {
    "case_number": "Crl. Appeal No.526 of 2014",
    "case_title": "Ashok Laxman Bhagyawant vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "26th August, 2020",
    "appellant_or_petitioner": "Ashok Laxman Bhagyawant",
    "respondent": "The State of Maharashtra",
    "judges_coram": "Revati Mohite Dere & M. S. Karnik, JJ.",
    "counsel_for_appellant": "Mr. D. G. Khamkar",
    "counsel_for_respondent": "Mr. H. J. Dedhia, A.P.P.",
    "sections_invoked": "Sections 302, 498A, and 304B of the Indian Penal Code",
    "case_type": "Criminal Appeal",
    "citation": "",
    "acts_and_sections": "Indian Penal Code Sections 302 (murder), 498A (cruelty by husband or relatives), and 304B (dowry death)."
  },
  "residual_details": {
    "additional_facts": "The trial court acquitted the appellant's brother and mother of all charges. The appellant was initially convicted under Sections 302 and 498A, but acquitted of Section 304B. The defense argued for a lesser charge under Section 304 Part II, claiming the injuries were not intentional but occurred during a robbery attempt."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:33:26.410889"
}