{
  "tier_1_determinative": {
    "key_facts": "The applicant, Ashwinikunal Ashokkumar Singh, was convicted for multiple offenses including murder (Section 302 IPC), criminal conspiracy (Section 120B r/w 34 IPC), robbery (Section 394 r/w 34 IPC), and house-trespass (Section 449 r/w 34 IPC) along with co-accused. The sentences were to run concurrently. The conviction was based on circumstantial evidence including recovery of imitation jewellery and a cutter, alleged extra-judicial confession, and testimony regarding intent to commit robbery."
  },
  "tier_2_material": {
    "material_facts": "The prosecution's case relied on circumstantial evidence such as the recovery of imitation jewellery and a cutter from the applicant, an extra-judicial confession allegedly made by co-accused Virendra, and testimony from a witness, PW7 Kalpana Borole, who claimed the applicant visited her residence with intent to commit robbery. However, the witness's credibility was questioned during cross-examination."
  },
  "tier_3_contextual": {
    "incident_location": "Kalyan, Thane, Maharashtra",
    "incident_date_time": "The conviction judgment was dated 19th June, 2023, but the incident date is not explicitly mentioned."
  },
  "tier_4_procedural": {
    "case_number": "Criminal Appeal No. 845 of 2023",
    "case_title": "Ashwinikunal Ashokkumar Singh vs. The State of Maharashtra",
    "court_name": "High Court of Judicature at Bombay",
    "judgment_date": "20th December 2023",
    "appellant_or_petitioner": "Ashwinikunal Ashokkumar Singh",
    "respondent": "The State of Maharashtra",
    "judges_coram": "Revati Mohite Dere & Gauri Godse, JJ.",
    "counsel_for_appellant": "Mr. Mohammed Umar Kazi a/w Mr. Abdul Wahab Shaikh",
    "counsel_for_respondent": "Mr. J. P. Yagnik, Addl. P.P",
    "sections_invoked": "Sections 302, 120B r/w 34, 394 r/w 34, 449 r/w 34 of the Indian Penal Code",
    "case_type": "Criminal Appeal",
    "citation": "",
    "acts_and_sections": "Indian Penal Code, Sections 302, 120B, 394, 449, and 34"
  },
  "residual_details": {
    "additional_facts": "The applicant has been in custody since 23rd October 2014 and has no prior criminal antecedents. The appeal's hearing is not expected in the immediate future. The co-accused Virendra was granted bail earlier, and the evidence against the applicant was deemed similar, leading to the granting of bail on grounds of parity."
  },
  "template_id": "legal_case",
  "template_label": "Legal Case",
  "extraction_confidence": 1.0,
  "extraction_timestamp": "2025-11-12T14:33:46.300982"
}